Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength.#ctor(Autodesk.Revit.DB.ElementId)
Create a constraint to drive sagitta length.
paramId:
The Id of a Rebar Shape parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength
A constraint that can be applied to a RebarShapeDefinitionByArc
and drives the height of the arc.
Since:
2012